# Orders

In [51]:
import pandas as pd

In [108]:
init_orders = pd.read_csv("../../eniac-data/orders.csv")


def start_pipeline(data_frame):
    return data_frame.copy()

def rename_columns(data_frame):
    return (data_frame
            .rename(columns={"created_date": "order_created_at",
                             "total_paid": "order_value",
                             "state": "order_status"}))

def set_data_types(data_frame):
    data_frame.assign(\
              order_created_at=lambda d: pd.to_datetime(d['order_created_at'], format="%Y-%m-%d %H:%M:%S"))
    data_frame["order_status"] = data_frame["order_status"].astype("category")

    data_frame["order_id"] = data_frame["order_id"].astype("str")
    return data_frame


def remove_outliers(data_frame):
    return data_frame

orders = init_orders\
        .pipe(start_pipeline)\
        .pipe(rename_columns)\
        .pipe(set_data_types)\
        .pipe(remove_outliers)

orders.shape

(226909, 4)

In [92]:
init_orders.head()

   order_id         created_date  total_paid      state
0    241319  2017-01-02 13:35:40       44.99  Cancelled
1    241423  2017-11-06 13:10:02      136.15  Completed
2    242832  2017-12-31 17:40:03       15.76  Completed
3    243330  2017-02-16 10:59:38       84.98  Completed
4    243784  2017-11-24 13:35:19      157.86  Cancelled

In [100]:
orders.head()

   order_id     order_created_at  order_value order_status
0    241319  2017-01-02 13:35:40        44.99    Cancelled
1    241423  2017-11-06 13:10:02       136.15    Completed
2    242832  2017-12-31 17:40:03        15.76    Completed
3    243330  2017-02-16 10:59:38        84.98    Completed
4    243784  2017-11-24 13:35:19       157.86    Cancelled

In [109]:
orders.dtypes

order_id              object
order_created_at      object
order_value          float64
order_status        category
dtype: object

In [102]:
init_orders.dtypes

order_id          int64
created_date     object
total_paid      float64
state            object
dtype: object

In [97]:
orders.describe()

            order_id    order_value
count  226909.000000  226904.000000
mean   413296.482480     569.225818
std     65919.250331    1761.778002
min    241319.000000       0.000000
25%    356263.000000      34.190000
50%    413040.000000     112.990000
75%    470553.000000     525.980000
max    527401.000000  214747.530000

In [111]:
orders.to_csv("../../clean_data/clean_orders.csv")